In [1]:
import numpy as np
import pandas as pd

In [10]:
df = pd.DataFrame({'col1': [1,2,3,4],
                   'col2': [444,555,666,444],
                   'col3': ['abc','def','ghi','xyz']
                  })

In [11]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [13]:
list(df['col2'].unique())

[444, 555, 666]

In [14]:
df['col2'].nunique()

3

In [16]:
len(df['col2'].unique())

3

In [17]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [18]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [19]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [23]:
(df['col1']>2) & (df['col2']==444)

0    False
1    False
2    False
3     True
dtype: bool

# APPLY

In [25]:
def times2(x):
    return x*2

In [26]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [28]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [54]:
df['new_column'] = df['col1'].apply(lambda x: df['col2'].unique().min()/df['col2'].unique().min())
df['new_column_power'] = df['col1'].apply(lambda x: x**x)

In [55]:
df

   col1  col2 col3  new_column  new_column_power
0     1   444  abc         1.0                 1
1     2   555  def         1.0                 4
2     3   666  ghi         1.0                27
3     4   444  xyz         1.0               256

In [56]:
df.columns

Index(['col1', 'col2', 'col3', 'new_column', 'new_column_power'], dtype='object')

In [59]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [61]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

# SORT

In [67]:
df.sort_values('col2', axis=0)

   col1  col2 col3  new_column  new_column_power
0     1   444  abc         1.0                 1
3     4   444  xyz         1.0               256
1     2   555  def         1.0                 4
2     3   666  ghi         1.0                27

# Find nulls

In [68]:
df.isnull()

    col1   col2   col3  new_column  new_column_power
0  False  False  False       False             False
1  False  False  False       False             False
2  False  False  False       False             False
3  False  False  False       False             False

# Pivot Tables

In [69]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [70]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [75]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [79]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN